assets/script/logs/shipping/2013-04-15/2013-04-15-14.26.04-get-services.log


Action: get-services
Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>blochretail</ns3:Username><ns3:Password>F8MZqdRXz</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>3C9B45F3E8717303</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:RateRequest><ns1:Request><ns1:RequestOption>Shop</ns1:RequestOption></ns1:Request><ns2:Shipment><ns2:Shipper><ns2:Name>Bloch</ns2:Name><ns2:ShipperNumber></ns2:ShipperNumber><ns2:Address><ns2:AddressLine>1170 Trademark Drive, Suite 112</ns2:AddressLine><ns2:City>Reno</ns2:City><ns2:StateProvinceCode>NV</ns2:StateProvinceCode><ns2:PostalCode>89521</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:Shipper><ns2:ShipTo><ns2:Name>dname</ns2:Name><ns2:Address><ns2:AddressLine>670 Park Avenue</ns2:AddressLine><ns2:City>Saint Clair</ns2:City><ns2:StateProvinceCode></ns2:StateProvinceCode><ns2:PostalCode>35004</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode><ns2:ResidentialAddressIndicator></ns2:ResidentialAddressIndicator></ns2:Address></ns2:ShipTo><ns2:ShipFrom><ns2:Name>Bloch</ns2:Name><ns2:Address><ns2:AddressLine>1170 Trademark Drive, Suite 112</ns2:AddressLine><ns2:City>Reno</ns2:City><ns2:StateProvinceCode>NV</ns2:StateProvinceCode><ns2:PostalCode>89521</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipFrom><ns2:Package><ns2:PackagingType><ns2:Code>02</ns2:Code><ns2:Description>Rate</ns2:Description></ns2:PackagingType><ns2:PackageWeight><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code><ns2:Description>Pounds</ns2:Description></ns2:UnitOfMeasurement><ns2:Weight>0.7</ns2:Weight></ns2:PackageWeight><ns2:PackageServiceOptions><ns2:DeclaredValue><ns2:CurrencyCode>USD</ns2:CurrencyCode><ns2:MonetaryValue>66</ns2:MonetaryValue></ns2:DeclaredValue></ns2:PackageServiceOptions></ns2:Package><ns2:ShipmentServiceOptions/></ns2:Shipment></ns2:RateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><rate:RateResponse xmlns:rate="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus><common:Alert><common:Code>110971</common:Code><common:Description>Your invoice may vary from the displayed reference rates</common:Description></common:Alert><common:Alert><common:Code>110920</common:Code><common:Description>Ship To Address Classification is changed from Residential to Commercial</common:Description></common:Alert><common:TransactionReference/></common:Response><rate:RatedShipment><rate:Service><rate:Code>03</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:RatedShipmentAlert><rate:Code>110920</rate:Code><rate:Description>Ship To Address Classification is changed from Residential to Commercial</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>7.75</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>7.75</rate:MonetaryValue></rate:TotalCharges><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>7.75</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>7.75</rate:MonetaryValue></rate:TotalCharges><rate:Weight>0.7</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>12</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:RatedShipmentAlert><rate:Code>110920</rate:Code><rate:Description>Ship To Address Classification is changed from Residential to Commercial</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>17.42</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>17.42</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>3</rate:BusinessDaysInTransit></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>17.42</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>17.42</rate:MonetaryValue></rate:TotalCharges><rate:Weight>0.7</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>59</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:RatedShipmentAlert><rate:Code>110920</rate:Code><rate:Description>Ship To Address Classification is changed from Residential to Commercial</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>26.04</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>26.04</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>2</rate:BusinessDaysInTransit><rate:DeliveryByTime>12:00 Noon</rate:DeliveryByTime></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>26.04</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>26.04</rate:MonetaryValue></rate:TotalCharges><rate:Weight>0.7</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>02</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:RatedShipmentAlert><rate:Code>110920</rate:Code><rate:Description>Ship To Address Classification is changed from Residential to Commercial</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>22.62</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>22.62</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>2</rate:BusinessDaysInTransit></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>22.62</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>22.62</rate:MonetaryValue></rate:TotalCharges><rate:Weight>0.7</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>13</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:RatedShipmentAlert><rate:Code>110920</rate:Code><rate:Description>Ship To Address Classification is changed from Residential to Commercial</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>54.10</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>54.10</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>1</rate:BusinessDaysInTransit><rate:DeliveryByTime>4:30 P.M.</rate:DeliveryByTime></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>54.10</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>54.10</rate:MonetaryValue></rate:TotalCharges><rate:Weight>0.7</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>14</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:RatedShipmentAlert><rate:Code>110920</rate:Code><rate:Description>Ship To Address Classification is changed from Residential to Commercial</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.02</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.02</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>1</rate:BusinessDaysInTransit><rate:DeliveryByTime>8:30 A.M.</rate:DeliveryByTime></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.02</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.02</rate:MonetaryValue></rate:TotalCharges><rate:Weight>0.7</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>01</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:RatedShipmentAlert><rate:Code>110920</rate:Code><rate:Description>Ship To Address Classification is changed from Residential to Commercial</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.42</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.42</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>1</rate:BusinessDaysInTransit><rate:DeliveryByTime>12:00 Noon</rate:DeliveryByTime></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.42</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.42</rate:MonetaryValue></rate:TotalCharges><rate:Weight>0.7</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>1.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment></rate:RateResponse></soapenv:Body></soapenv:Envelope>
